# SpaceTypeId Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassZone..::..SpaceTypeId Property
MassZone Class See Also
---
The space type element of the MassZone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId SpaceTypeId { get; set; }
```

Visual Basic
---
```text
Public Property SpaceTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ SpaceTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace